import RingSize from "../models/RingSize.js"

const sizes = ['41(р)-13.0(mm)', '42(р)-13.4(mm)',
    '43(р)-13.7(mm)', '44(р)-14.0(mm)', '45(р)-14.3(mm)',
    '46(р)-14.6(mm)', '47(р)-15.0(mm)', '48(р)-15.3(mm)',
    '49(р)-15.6(mm)', '50(р)-15.9(mm)', '51(р)-16.2(mm)',
    '52(р)-16.5(mm)', '53(р)-16.8(mm)', '54(р)-17.2(mm)',
    '55(р)-17.5(mm)', '56(р)-17.8(mm)', '57(р)-18.1(mm)',
    '58(р)-18.4(mm)', '59(р)-18.8(mm)', '60(р)-19.1(mm)',
    '61(р)-19.4(mm)', '62(р)-19.7(mm)', '63(р)-20.0(mm)',
    '64(р)-20.3(mm)', '65(р)-20.6(mm)', '66(р)-21.0(mm)',
    '67(р)-21.3(mm)', '68(р)-21.6(mm)', '69(р)-22.0(mm)',
    '70(р)-22.3(mm)', '71(р)-22.6(mm)', '72(р)-22.9(mm)',
    '73(р)-23.2(mm)', '74(р)-23.5(mm)', '75(р)-23.9(mm)',
    '76(р)-24.2(mm)']

let data = await RingSize.find({})

if (data.length === 0) {
    for (let index = 0; index < sizes.length; index++) {
        const element = sizes[index];

        let size = new RingSize({ size: element })

        await size.save()
    }
}